Repository: ViktorEjik/pythonprac
Catalog: 20240427/1/mood/po/*.UTF-8/LC_MESSAGES/server.po
Languages: ru_ru

source: User {} connected
ru_ru: Пользователь {} подключился

source: Moving monsters:
ru_ru: Бродячие монстры:

source: Move to {}
ru_ru: Вы переместились в {}

source: Added monster {} to
ru_ru: Монстр {} добавлен в

source: saying "{}"
ru_ru: говорит "{}"

source: Cannot add unknown monster
ru_ru: Невозможно добавить неизвестного монстра

source: Replaced the old monster
ru_ru: Старый монстр заменён

source: User {}
ru_ru: Пользователь {}

source: added monster {}
ru_ru: добавил монстра {}

source: with {} hp
ru_ru: c {} очком здоровья

source: {} died
ru_ru: {} мертв

source: attacked monster {}
ru_ru: атаковал монстра {}

source: with {},
ru_ru: при помощи {},

source: damage {} hp
ru_ru: нанес {} еденицу урона

source: No monster here
ru_ru: Здесь нет монстра

source: No {} here
ru_ru: {} нет здесь

source: Unknown weapon
ru_ru: Неизвестное оружие

source: {} now has {} hp
ru_ru: {} сейчас имеет {} очко здоровья

source: {} disconnected
ru_ru: {} отключился
